; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-8-7-20)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	driver7 - driver
	driver8 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p0-1 - location
	p0-2 - location
	p0-4 - location
	p1-0 - location
	p1-4 - location
	p1-5 - location
	p3-0 - location
	p4-3 - location
	p5-0 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s3)
	(at driver3 s4)
	(at driver4 s5)
	(at driver5 s4)
	(at driver6 s1)
	(at driver7 s5)
	(at driver8 s3)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s1)
	(empty truck2)
	(at truck3 s4)
	(empty truck3)
	(at truck4 s5)
	(empty truck4)
	(at truck5 s2)
	(empty truck5)
	(at truck6 s5)
	(empty truck6)
	(at truck7 s5)
	(empty truck7)
	(at package1 s3)
	(at package2 s5)
	(at package3 s2)
	(at package4 s5)
	(at package5 s2)
	(at package6 s2)
	(at package7 s2)
	(at package8 s4)
	(at package9 s1)
	(at package10 s1)
	(at package11 s4)
	(at package12 s5)
	(at package13 s3)
	(at package14 s0)
	(at package15 s2)
	(at package16 s5)
	(at package17 s5)
	(at package18 s0)
	(at package19 s0)
	(at package20 s5)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(link s0 s1)
	(link s1 s0)
	(link s0 s2)
	(link s2 s0)
	(link s1 s4)
	(link s4 s1)
	(link s2 s1)
	(link s1 s2)
	(link s2 s4)
	(link s4 s2)
	(link s3 s0)
	(link s0 s3)
	(link s3 s2)
	(link s2 s3)
	(link s3 s5)
	(link s5 s3)
	(link s4 s0)
	(link s0 s4)
	(link s4 s3)
	(link s3 s4)
	(link s4 s5)
	(link s5 s4)
	(link s5 s0)
	(link s0 s5)
	(link s5 s1)
	(link s1 s5)
)
	(:goal (and
	(at driver2 s1)
	(at driver3 s1)
	(at driver4 s3)
	(at driver5 s1)
	(at driver6 s4)
	(at driver7 s3)
	(at driver8 s4)
	(at truck1 s5)
	(at truck5 s5)
	(at truck7 s2)
	(at package1 s4)
	(at package2 s3)
	(at package3 s1)
	(at package4 s3)
	(at package5 s5)
	(at package7 s3)
	(at package8 s5)
	(at package9 s5)
	(at package10 s4)
	(at package11 s2)
	(at package12 s1)
	(at package13 s4)
	(at package14 s3)
	(at package15 s0)
	(at package16 s2)
	(at package17 s5)
	(at package18 s3)
	(at package19 s5)
	(at package20 s1)
	))


)

; plan
1. (walk driver1 s1 p0-1)
   deleted: (at driver1 s1)
   added: (at driver1 p0-1)
   goals met: 1 of 29
2. (walk driver1 p0-1 s0)
   deleted: (at driver1 p0-1)
   added: (at driver1 s0)
   goals met: 1 of 29
3. (walk driver1 s0 p0-2)
   deleted: (at driver1 s0)
   added: (at driver1 p0-2)
   goals met: 1 of 29
4. (walk driver1 p0-2 s2)
   deleted: (at driver1 p0-2)
   added: (at driver1 s2)
   goals met: 1 of 29
5. (board-truck driver1 s2 truck1)
   deleted: (at driver1 s2) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 1 of 29
6. (board-truck driver4 s5 truck4)
   deleted: (at driver4 s5) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 1 of 29
7. (board-truck driver7 s5 truck7)
   deleted: (at driver7 s5) (empty truck7)
   added: (driving driver7 truck7)
   goals met: 1 of 29
8. (load-truck s1 package9 truck2)
   deleted: (at package9 s1)
   added: (in package9 truck2)
   goals met: 1 of 29
9. (board-truck driver6 s1 truck2)
   deleted: (at driver6 s1) (empty truck2)
   added: (driving driver6 truck2)
   goals met: 1 of 29
10. (drive-truck driver6 s1 s4 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   goals met: 1 of 29
11. (load-truck s4 package8 truck2)
   deleted: (at package8 s4)
   added: (in package8 truck2)
   goals met: 1 of 29
12. (load-truck s4 package11 truck2)
   deleted: (at package11 s4)
   added: (in package11 truck2)
   goals met: 1 of 29
13. (drive-truck driver4 s5 s3 truck4)
   deleted: (at truck4 s5)
   added: (at truck4 s3)
   goals met: 1 of 29
14. (load-truck s3 package13 truck4)
   deleted: (at package13 s3)
   added: (in package13 truck4)
   goals met: 1 of 29
15. (load-truck s3 package1 truck4)
   deleted: (at package1 s3)
   added: (in package1 truck4)
   goals met: 1 of 29
16. (drive-truck driver4 s3 s4 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s4)
   goals met: 1 of 29
17. (unload-truck s4 package13 truck4)
   deleted: (in package13 truck4)
   added: (at package13 s4)
   goals met: 2 of 29
18. (unload-truck s4 package1 truck4)
   deleted: (in package1 truck4)
   added: (at package1 s4)
   goals met: 3 of 29
19. (drive-truck driver4 s4 s3 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s3)
   goals met: 3 of 29
20. (disembark-truck driver4 s3 truck4)
   deleted: (driving driver4 truck4)
   added: (at driver4 s3) (empty truck4)
   goals met: 4 of 29
21. (load-truck s2 package7 truck1)
   deleted: (at package7 s2)
   added: (in package7 truck1)
   goals met: 4 of 29
22. (load-truck s2 package5 truck1)
   deleted: (at package5 s2)
   added: (in package5 truck1)
   goals met: 4 of 29
23. (drive-truck driver1 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 4 of 29
24. (drive-truck driver6 s4 s2 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s2)
   goals met: 4 of 29
25. (load-truck s2 package3 truck2)
   deleted: (at package3 s2)
   added: (in package3 truck2)
   goals met: 4 of 29
26. (drive-truck driver6 s2 s1 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   goals met: 4 of 29
27. (unload-truck s1 package3 truck2)
   deleted: (in package3 truck2)
   added: (at package3 s1)
   goals met: 5 of 29
28. (load-truck s1 package10 truck2)
   deleted: (at package10 s1)
   added: (in package10 truck2)
   goals met: 5 of 29
29. (drive-truck driver6 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 5 of 29
30. (drive-truck driver6 s2 s4 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s4)
   goals met: 5 of 29
31. (unload-truck s4 package10 truck2)
   deleted: (in package10 truck2)
   added: (at package10 s4)
   goals met: 6 of 29
32. (load-truck s0 package19 truck1)
   deleted: (at package19 s0)
   added: (in package19 truck1)
   goals met: 6 of 29
33. (drive-truck driver1 s0 s5 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s5)
   goals met: 7 of 29
34. (unload-truck s5 package5 truck1)
   deleted: (in package5 truck1)
   added: (at package5 s5)
   goals met: 8 of 29
35. (unload-truck s5 package19 truck1)
   deleted: (in package19 truck1)
   added: (at package19 s5)
   goals met: 9 of 29
36. (load-truck s5 package16 truck1)
   deleted: (at package16 s5)
   added: (in package16 truck1)
   goals met: 9 of 29
37. (drive-truck driver1 s5 s3 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   goals met: 8 of 29
38. (drive-truck driver1 s3 s0 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   goals met: 8 of 29
39. (load-truck s0 package18 truck1)
   deleted: (at package18 s0)
   added: (in package18 truck1)
   goals met: 8 of 29
40. (drive-truck driver1 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 8 of 29
41. (unload-truck s2 package16 truck1)
   deleted: (in package16 truck1)
   added: (at package16 s2)
   goals met: 9 of 29
42. (drive-truck driver1 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 9 of 29
43. (unload-truck s3 package7 truck1)
   deleted: (in package7 truck1)
   added: (at package7 s3)
   goals met: 10 of 29
44. (unload-truck s3 package18 truck1)
   deleted: (in package18 truck1)
   added: (at package18 s3)
   goals met: 11 of 29
45. (drive-truck driver1 s3 s0 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   goals met: 11 of 29
46. (load-truck s0 package14 truck1)
   deleted: (at package14 s0)
   added: (in package14 truck1)
   goals met: 11 of 29
47. (drive-truck driver1 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 11 of 29
48. (load-truck s2 package15 truck1)
   deleted: (at package15 s2)
   added: (in package15 truck1)
   goals met: 11 of 29
49. (drive-truck driver1 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 11 of 29
50. (unload-truck s0 package15 truck1)
   deleted: (in package15 truck1)
   added: (at package15 s0)
   goals met: 12 of 29
51. (drive-truck driver1 s0 s3 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   goals met: 12 of 29
52. (unload-truck s3 package14 truck1)
   deleted: (in package14 truck1)
   added: (at package14 s3)
   goals met: 13 of 29
53. (drive-truck driver1 s3 s5 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s5)
   goals met: 14 of 29
54. (drive-truck driver7 s5 s3 truck7)
   deleted: (at truck7 s5)
   added: (at truck7 s3)
   goals met: 14 of 29
55. (load-truck s5 package4 truck1)
   deleted: (at package4 s5)
   added: (in package4 truck1)
   goals met: 14 of 29
56. (load-truck s5 package20 truck1)
   deleted: (at package20 s5)
   added: (in package20 truck1)
   goals met: 14 of 29
57. (load-truck s5 package2 truck1)
   deleted: (at package2 s5)
   added: (in package2 truck1)
   goals met: 14 of 29
58. (load-truck s5 package12 truck1)
   deleted: (at package12 s5)
   added: (in package12 truck1)
   goals met: 14 of 29
59. (drive-truck driver7 s3 s2 truck7)
   deleted: (at truck7 s3)
   added: (at truck7 s2)
   goals met: 15 of 29
60. (walk driver2 s3 p4-3)
   deleted: (at driver2 s3)
   added: (at driver2 p4-3)
   goals met: 15 of 29
61. (walk driver2 p4-3 s4)
   deleted: (at driver2 p4-3)
   added: (at driver2 s4)
   goals met: 15 of 29
62. (walk driver2 s4 p1-4)
   deleted: (at driver2 s4)
   added: (at driver2 p1-4)
   goals met: 15 of 29
63. (walk driver2 p1-4 s1)
   deleted: (at driver2 p1-4)
   added: (at driver2 s1)
   goals met: 16 of 29
64. (walk driver3 s4 p1-4)
   deleted: (at driver3 s4)
   added: (at driver3 p1-4)
   goals met: 16 of 29
65. (walk driver3 p1-4 s1)
   deleted: (at driver3 p1-4)
   added: (at driver3 s1)
   goals met: 17 of 29
66. (walk driver5 s4 p1-4)
   deleted: (at driver5 s4)
   added: (at driver5 p1-4)
   goals met: 17 of 29
67. (walk driver5 p1-4 s1)
   deleted: (at driver5 p1-4)
   added: (at driver5 s1)
   goals met: 18 of 29
68. (walk driver8 s3 p4-3)
   deleted: (at driver8 s3)
   added: (at driver8 p4-3)
   goals met: 18 of 29
69. (walk driver8 p4-3 s4)
   deleted: (at driver8 p4-3)
   added: (at driver8 s4)
   goals met: 19 of 29
70. (drive-truck driver6 s4 s5 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s5)
   goals met: 19 of 29
71. (unload-truck s5 package9 truck2)
   deleted: (in package9 truck2)
   added: (at package9 s5)
   goals met: 20 of 29
72. (unload-truck s5 package8 truck2)
   deleted: (in package8 truck2)
   added: (at package8 s5)
   goals met: 21 of 29
73. (drive-truck driver6 s5 s4 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s4)
   goals met: 21 of 29
74. (drive-truck driver6 s4 s2 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s2)
   goals met: 21 of 29
75. (unload-truck s2 package11 truck2)
   deleted: (in package11 truck2)
   added: (at package11 s2)
   goals met: 22 of 29
76. (drive-truck driver6 s2 s4 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s4)
   goals met: 22 of 29
77. (disembark-truck driver6 s4 truck2)
   deleted: (driving driver6 truck2)
   added: (at driver6 s4) (empty truck2)
   goals met: 23 of 29
78. (drive-truck driver1 s5 s1 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s1)
   goals met: 22 of 29
79. (unload-truck s1 package20 truck1)
   deleted: (in package20 truck1)
   added: (at package20 s1)
   goals met: 23 of 29
80. (drive-truck driver1 s1 s5 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s5)
   goals met: 24 of 29
81. (drive-truck driver1 s5 s3 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   goals met: 23 of 29
82. (unload-truck s3 package4 truck1)
   deleted: (in package4 truck1)
   added: (at package4 s3)
   goals met: 24 of 29
83. (unload-truck s3 package2 truck1)
   deleted: (in package2 truck1)
   added: (at package2 s3)
   goals met: 25 of 29
84. (drive-truck driver1 s3 s5 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s5)
   goals met: 26 of 29
85. (drive-truck driver1 s5 s1 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s1)
   goals met: 25 of 29
86. (unload-truck s1 package12 truck1)
   deleted: (in package12 truck1)
   added: (at package12 s1)
   goals met: 26 of 29
87. (drive-truck driver1 s1 s5 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s5)
   goals met: 27 of 29
88. (disembark-truck driver7 s2 truck7)
   deleted: (driving driver7 truck7)
   added: (at driver7 s2) (empty truck7)
   goals met: 27 of 29
89. (board-truck driver7 s2 truck5)
   deleted: (at driver7 s2) (empty truck5)
   added: (driving driver7 truck5)
   goals met: 27 of 29
90. (drive-truck driver7 s2 s3 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s3)
   goals met: 27 of 29
91. (disembark-truck driver1 s5 truck1)
   deleted: (driving driver1 truck1)
   added: (at driver1 s5) (empty truck1)
   goals met: 27 of 29
92. (board-truck driver1 s5 truck6)
   deleted: (at driver1 s5) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 27 of 29
93. (drive-truck driver1 s5 s3 truck6)
   deleted: (at truck6 s5)
   added: (at truck6 s3)
   goals met: 27 of 29
94. (disembark-truck driver1 s3 truck6)
   deleted: (driving driver1 truck6)
   added: (at driver1 s3) (empty truck6)
   goals met: 27 of 29
95. (disembark-truck driver7 s3 truck5)
   deleted: (driving driver7 truck5)
   added: (at driver7 s3) (empty truck5)
   goals met: 28 of 29
96. (board-truck driver1 s3 truck5)
   deleted: (at driver1 s3) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 28 of 29
97. (drive-truck driver1 s3 s5 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s5)
   goals met: 29 of 29
